# IsModified Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..IsModified Property
Document Class See Also
---
The state of changes made to the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsModified { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsModified As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsModified {
	bool get ();
}
```

# See Also
Document Class
Autodesk.Revit.DB Namespace